CSI API ETABS v1
cCaseModalEigen.SetLoads Method
 This function sets the load data for the specified load case.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int SetLoads(
	string Name,
	int NumberLoads,
	ref string[] LoadType,
	ref string[] LoadName,
	ref double[] TargetPar,
	ref bool[] StaticCorrect
)
Function SetLoads (
	Name As String,
	NumberLoads As Integer,
	ByRef LoadType As String(),
	ByRef LoadName As String(),
	ByRef TargetPar As Double(),
	ByRef StaticCorrect As Boolean()
) As Integer
Dim instance As cCaseModalEigen
Dim Name As String
Dim NumberLoads As Integer
Dim LoadType As String()
Dim LoadName As String()
Dim TargetPar As Double()
Dim StaticCorrect As Boolean()
Dim returnValue As Integer
returnValue = instance.SetLoads(Name,
	NumberLoads, LoadType, LoadName,
	TargetPar, StaticCorrect)
int SetLoads(
	String^ Name,
	int NumberLoads,
	array<String^>^% LoadType,
	array<String^>^% LoadName,
	array<double>^% TargetPar,
	array<bool>^% StaticCorrect
)
abstract SetLoads :
        Name : string *
        NumberLoads : int *
        LoadType : string[] byref *
        LoadName : string[] byref *
        TargetPar : float[] byref *
        StaticCorrect : bool[] byref -> int
Parameters
Name
Type: System.String
 The name of an existing modal Eigen load case.
NumberLoads
Type: System.Int32
 The number of loads assigned to the specified analysis case.
LoadType
Type: System.String[]
 This is an array that includes Load, Accel or Link, indicating the type of each load assigned to the load case.
LoadName
Type: System.String[]
 This is an array that includes the name of each load assigned to the load case. If the LoadType item is Load, this item is the name of a defined load pattern. If the LoadType item is Accel, this item is UX, UY, UZ, RX, RY or RZ, indicating the direction of the load. If the LoadType item is Link, this item is not used.
TargetPar
Type: System.Double[]
 This is an array that includes the target mass participation ratio.
StaticCorrect
Type: System.Boolean[]
 This is an array that includes either 0 or 1, indicating if static correction modes are to be calculated.
Return Value
Type: Int32
 The function returns zero if the data is successfully set; otherwise it returns a nonzero value.
Remarks
Examples
Public Sub Example()
   Dim SapModel As cSapModel
   Dim EtabsObject As cOAPI
   Dim ret As Integer = -1
   Dim InitialCase As String
   Dim MyLoadType() As String
   Dim MyLoadName() As String
   Dim MyTargetPar() As Double
   Dim MyStaticCorrect() As Boolean
'create ETABS object
   Dim myHelper as cHelper = New Helper
   EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
'start ETABS application
  ret = EtabsObject.ApplicationStart()
'create SapModel object
   SapModel = EtabsObject.SapModel
'initialize model
   ret = SapModel.InitializeNewModel()
'create steel deck template model
    ret = SapModel.File.NewSteelDeck(4, 12, 12, 4, 4, 24, 24)
'add modal Eigen load case
    ret = SapModel.LoadCases.ModalEigen.SetCase("LCASE1")
'set load data
    ReDim MyLoadType(2)
    ReDim MyLoadName(2)
    ReDim MyTargetPar(2)
    ReDim MyStaticCorrect(2)
    MyLoadType(0) = "Load"
    MyLoadName(0) = "DEAD"
    MyTargetPar(0) = 99
    MyStaticCorrect(0) = 1
    MyLoadType(1) = "Accel"
    MyLoadName(1) = "UZ"
    MyTargetPar(1) = 99
    MyStaticCorrect(1) = 0
    MyLoadType(2) = "Link"
    MyTargetPar(2) = 99
    MyStaticCorrect(2) = 0
'add modal Eigen load case
    ret = SapModel.LoadCases.ModalEigen.SetLoads("LCASE1", 3, MyLoadType, MyLoadName, MyTargetPar, MyStaticCorrect)
'set load data
   ReDim MyLoadType(2)
   ReDim MyLoadName(2)
   ReDim MyTargetPar(2)
   ReDim MyStaticCorrect(2)
   MyLoadType(0) = "Load"
   MyLoadName(0) = "DEAD"
   MyTargetPar(0) = 99
   MyStaticCorrect(0) = 1
   MyLoadType(1) = "Accel"
   MyLoadName(1) = "UZ"
   MyTargetPar(1) = 99
   MyStaticCorrect(1) = 0
   MyLoadType(2) = "Link"
   MyTargetPar(2) = 99
   MyStaticCorrect(2) = 0
   ret = mySapModel.LoadCases.ModalEigen.SetLoads("LCASE1", 3, MyLoadType, MyLoadName, MyTargetPar, MyStaticCorrect)
'close ETABS
   EtabsObject.ApplicationExit(False)
'clean up variables
   SapModel = Nothing
   EtabsObject = Nothing
End Sub
See Also
Reference
cCaseModalEigen Interface
ETABSv1 Namespace